tap "homebrew/bundle"
tap "homebrew/cask-fonts"
brew "python@3.11", link: false
brew "ansible"
brew "giflib"
brew "zstd"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "docutils"
brew "awscli"
brew "boost"
brew "glib"
brew "cairo"
brew "ruby"
brew "cocoapods"
brew "coreutils"
brew "libssh2"
brew "curl", link: true
brew "folly"
brew "edencommon"
brew "exiftool"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "gcc"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "openjpeg"
brew "leptonica"
brew "libass"
brew "pango"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "open-mpi"
brew "fftw"
brew "findutils"
brew "fzf"
brew "gdk-pixbuf"
brew "ghostscript"
brew "git"
brew "pinentry"
brew "gnupg"
brew "pkg-config"
brew "gobject-introspection"
brew "grep"
brew "guile"
brew "hdf5"
brew "shared-mime-info"
brew "libheif"
brew "python@3.9"
brew "imagemagick"
brew "jpeg", link: true
brew "jq"
brew "lazygit"
brew "ldns"
brew "libfido2"
brew "libgsf"
brew "libmatio"
brew "libproxy"
brew "librsvg"
brew "neovim"
brew "nghttp2"
brew "nvm"
brew "openjdk"
brew "openslide"
brew "poppler"
brew "python@3.10"
brew "qt"
brew "ripgrep"
brew "tcl-tk"
brew "tmux"
brew "vips"
brew "watchman"
brew "yarn"
brew "youtube-dl"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
cask "1password"
cask "amethyst"
cask "arc"
cask "brave-browser"
cask "cleanshot"
cask "discord"
cask "docker"
cask "figma"
cask "firefox"
cask "font-0xproto-nerd-font"
cask "font-fira-code"
cask "font-monaspace"
cask "google-drive"
cask "graphql-playground"
cask "hiddenbar"
cask "iterm2"
cask "linear-linear"
cask "menubar-stats"
cask "moom"
cask "notion"
cask "obs"
cask "obsidian"
cask "protonvpn"
cask "raspberry-pi-imager"
cask "raycast"
cask "slack"
cask "stats"
cask "teamviewer"
cask "the-unarchiver"
cask "thonny"
cask "tunnelblick"
cask "via"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
vscode "astro-build.astro-vscode"
vscode "ban.spellright"
vscode "bbenoist.nix"
vscode "bradlc.vscode-tailwindcss"
vscode "continue.continue"
vscode "dbaeumer.vscode-eslint"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "ex3ndr.llama-coder"
vscode "johnpapa.vscode-peacock"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "mushan.vscode-paste-image"
vscode "prisma.prisma"
vscode "rjmacarthy.twinny"
vscode "rust-lang.rust-analyzer"
vscode "samuelcolvin.jinjahtml"
vscode "serayuzgur.crates"
vscode "smallcloud.codify"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "wix.vscode-import-cost"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
