tap "schpet/tap"
tap "sst/tap"
brew "bat"
brew "bash"
brew "coreutils"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "firebase-cli"
brew "fzf"
brew "gh"
brew "git-delta"
brew "jq"
brew "lazygit"
brew "mise"
brew "neovim"
brew "pipx"
brew "ripgrep"
brew "sox"
brew "starship"
brew "stow"
brew "tmux"
brew "yt-dlp"
brew "zellij"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "fzf-tab"
brew "schpet/tap/linear"
brew "sst/tap/opencode"
cask "1password"
cask "1password-cli"
cask "nikitabobko/tap/aerospace"
cask "appcleaner"
cask "brave-browser"
cask "claude"
cask "claude-code"
cask "cleanshot"
cask "darktable"
cask "discord"
cask "docker-desktop"
cask "figma"
cask "firefox"
cask "font-0xproto-nerd-font"
cask "font-fira-code"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "gitbutler"
cask "granola"
cask "helium-browser"
cask "hiddenbar"
cask "karabiner-elements"
cask "linear-linear"
cask "notion"
cask "obsidian"
cask "raspberry-pi-imager"
cask "raycast"
cask "slack"
cask "stats"
cask "teamviewer"
cask "the-unarchiver"
cask "tunnelblick"
cask "vlc"
cask "voiceink"
cask "zoom"
