tap "homebrew/bundle"
tap "homebrew/cask-fonts"
brew "giflib"
brew "zstd"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "cairo"
brew "exiftool"
brew "ffmpeg"
brew "findutils"
brew "fzf"
brew "git"
brew "grep"
brew "jpeg", link: true
brew "jq"
brew "lazygit"
brew "neovim"
brew "nvm"
brew "openjdk"
brew "ripgrep"
brew "stow"
brew "tmux"
brew "tree"
brew "watchman"
brew "yarn"
brew "youtube-dl"
brew "zoxide"
brew "zsh"
cask "1password"
cask "amethyst"
cask "brave-browser"
cask "cleanshot"
cask "discord"
cask "docker"
cask "figma"
cask "font-0xproto-nerd-font"
cask "hiddenbar"
cask "iterm2"
cask "linear-linear"
cask "notion"
cask "obsidian"
cask "raspberry-pi-imager"
cask "raycast"
cask "slack"
cask "stats"
cask "teamviewer"
cask "the-unarchiver"
cask "tunnelblick"
cask "via"
cask "vlc"
cask "zoom"
